/* 
  SBXErrors.strings
  Secrets

  Created by Paulo Andrade on 9/25/12.

*/

"UnexpectedError.errorDescription" = "Erro inesperado";
"UnexpectedError.failureReason" = "Desculpe mas a operação falhou devido a um erro inesperado. Por favor contate o suporte se o problema persistir.";

"ModelInvalidProperty.errorDescription" = "Valor inválido";
"ModelInvalidProperty.failureReason" = "A %@ %@ must be a %@";

"DataStoreIncompatibleMasterKeyError.errorDescription" = "Chave-mestra incompatível";
"DataStoreIncompatibleMasterKeyError.failureReason" = "A chave-mestra deste documento não é válida.";

"DataStoreMustBeUnlockedError.errorDescription" = "Dados trancados";
"DataStoreMustBeUnlockedError.failureReason" = "É necessário destrancar os dados para executar esta operação.";

"DataStoreNotPassphraseProtectedError.errorDescription" = "Dados desprotegidos";
"DataStoreNotPassphraseProtectedError.failureReason" = "Dados ainda não estão protegidos com uma palavra-passe.";

"DataStoreCorruptedError.errorDescription" = "Documento inválido";
"DataStoreCorruptedError.failureReason" = "Impossível abrir documento, possivelmente está corrompido.";

"DataStoreURLNotSetError.errorDescription" = "URL do documento não está definido";
"DataStoreURLNotSetError.failureReason" = "URL do documento tem de estar definido antes de poder executar esta operação";

"DataStoreSynchronizationFailedError.errorDescription" = "Sincronização falhou";
"DataStoreSynchronizationFailedError.failureReason" = "Sincronização falhou devido a um erro inesperado.";

"DataStoreIncorrectPassphraseError.errorDescription" = "Palavra-passe incorreta";
"DataStoreIncorrectPassphraseError.failureReason" = "Não foi possível destrancar os dados com a palavra-passe fornecida";

"DataStoreMigrationUnknownModelError.errorDescription" = "Atualização necessária";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets.
*/
"DataStoreMigrationUnknownModelError.failureReason" = "Aparentemente os dados foram guardados usando uma versão mais recente do %@";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets. Please update to the latest version and try again.
*/
"DataStoreMigrationUnknownModelError.recoverySuggestion" = "Aparentemente os dados foram guardados usando uma versão mais recente do %@. Por favor atualize para a última versão e tente novamente.";

"DataStoreMigrationSourceMetadataError.errorDescription" = "Formato de ficheiro desconhecido";
"DataStoreMigrationSourceMetadataError.failureReason" = "Impossível identificar o formato do ficheiro";

"NetworkConnectionVersionMismatchError.errorDescription" = "Versões incompatíveis";
"NetworkConnectionVersionMismatchError.failureReason" = "O dispositivo a que se está a ligar está a correr uma versão incompatível. Por favor verifique que o software está atualizado.";

"NetworkConnectionInterruptedError.errorDescription" = "Ligação falhou";
"NetworkConnectionInterruptedError.failureReason" = "A ligação foi interrompida inesperadamente.";

"NetworkConnectionBadRequestError.errorDescription" = "Ligação falhou";
"NetworkConnectionBadRequestError.failureReason" = "A ligação foi interrompido devido a um pedido mal formado.";

"NetworkConnectionInternalError.errorDescription" = "Ligação falhou";
"NetworkConnectionInternalError.failureReason" = "Ligação falhou devido a um erro interno";

"NetworkConnectionUnauthorizedRequestError.errorDescription" = "Ligação falhou";
"NetworkConnectionUnauthorizedRequestError.failureReason" = "A ligação foi interrompida devido a um pedido não autorizado.";

"NetworkConnectionFailedError.errorDescription" = "Ligação falhou";
"NetworkConnectionFailedError.failureReason" = "Impossível estabelecer ligação. Por favor verifique as definições do WiFi e Bluetooth.";

"NetworkConnectionTimedOutError.errorDescription" = "Ligação esgotou limite de tempo";
"NetworkConnectionTimedOutError.failureReason" = "Impossível estabelecer ligação em tempo útil.";

"OperationCancelledError.errorDescription" = "Operação cancelada";
"OperationCancelledError.failureReason" = "Operação cancelada pelo utilizador";

"OperationTimedOutError.errorDescription" = "Operação esgotou limite de tempo";
"OperationTimedOutError.failureReason" = "Operação não terminou dentro do limite de tempo";

"UbiquitousSyncNotEnabledError.errorDescription" = "iCloud Sync inativo";
"UbiquitousSyncNotEnabledError.failureReason" = "O iCloud Sync deve estar ativo para executar esta operação.";

"UbiquitousSyncIdentifierDiffersError.errorDescription" = "iCloud Sync incompatível";
"UbiquitousSyncIdentifierDiffersError.failureReason" = "Os dados no iCloud aparentam ser de outro utilizador. Certifique-se que o utilizador atual do iCloud é o mesmo de quando ativou o iCloud Sync.";

"UbiquitousStoreUnlockableError.errorDescription" = "Impossível sincronizar com o iCloud";
"UbiquitousStoreUnlockableError.failureReason" = "Impossível destrancar os dados do iCloud, a sua palavra-passe deve ter mudado.";
"UbiquitousStoreUnlockableError.recoverySuggestion" = "Se alterou sua palavra-passe noutro dispositivo, atualize novamente neste dispositivo para continuar a usar o iCloud Sync.";

"UbiquitousStoreUnprotectedError.errorDescription" = "Dados do iCloud não estão protegidos com uma palavra-passe";
"UbiquitousStoreUnprotectedError.failureReason" = "Sincronização com o iCloud abortada pois os dados não estão protegidos com uma palavra-passe";

"PairingFailedError.errorDescription" = "Emparelhamento falhou";
"PairingFailedError.failureReason" = "Impossível emparelhar";

"PairingDeniedError.errorDescription" = "Emparelhamento negado";
"PairingDeniedError.failureReason" = "Par negou o pedido de emparelhamento.";

"SyncingFailedError.errorDescription" = "Sincronização falhou";
"SyncingFailedError.failureReason" = "Impossível terminar sincronização";

"PersistentStoreLockedError.errorDescription" = "Dados estão a ser usados";
"PersistentStoreLockedError.failureReason" = "Tente novamente daqui a pouco.";

"UnsuportedDocumenTypeError.errorDescription" = "Tipo de documento não suportado";
"UnsuportedDocumenTypeError.failureReason" = "O documento pedido não é suportado.";

"WrongDocumentPassphraseError.errorDescription" = "Palavra-passe errada";
"WrongDocumentPassphraseError.failureReason" = "Impossível destrancar documento com a palavra-passe fornecida.";

/*
 * The %@ will be replaced by another application name. Example:
 * 
 * Failed to communicate with Safari.
*/
"ScriptingBridgeError.errorDescription" = "Comunicação com %@ falhou";
"ScriptingBridgeError.failureReason" = "Pedido a %@ para executar operação falhou.";

"CouldNotSaveDocumentError.errorDescription" = "Impossível guardar documento";
"CouldNotSaveDocumentError.failureReason" = "Um error ocorreu enquanto o seu documento era gravado.";

"SecureEnclaveNotAvailableError.errorDescription" = "Autenticação do dispositivo não disponível";
"SecureEnclaveNotAvailableError.failureReason" = "O seu dispositivo deve ter um código de acesso ou Touch ID ativo para usar esta funcionalidade";

"IACError.UnsupportedCallback" = "'%@' não é uma acção x-callback-url suportado por %@";
"IACError.UnsupportedScheme" = "Aplicação com o esquema '%@' não está instalada neste dispositivo";

"SyncMissingPremium.errorDescription" = "Sincronização desativada";
"SyncMissingPremium.failureReason" = "Atualize para o Premium para continuar a sincronizar mais de %d itens";

"ImportMissingPremium.errorDescription" = "Importação atingiu o limite de itens da versão Grátis";
"ImportMissingPremium.failureReason" = "A versão Grátis está limitada a %d itens. Por favor atualize e tente importar este ficheiro novamente.";

